{
  "backend/main.mo": "Motoko actor implementing user profiles, categories, works, and certificates with access control and CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping theme‑related feature requests to affected CSS files and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files including pages, components, hooks, and global styles.",
  "frontend/index.css": "Tailwind base stylesheet defining light and dark mode design tokens using OKLCH values.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root React app handling client-side routing, theming, and React Query provider setup.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/ContactForm.tsx": "Contact form with validation, controlled inputs, simulated submission, and success feedback.",
  "frontend/src/components/SiteLayout.tsx": "Main layout with navigation, theme toggle, mobile menu, and authentication controls.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides authentication and admin authorization state by checking identity and querying the actor.",
  "frontend/src/hooks/useCertificates.ts": "React Query hooks for fetching and mutating certificate data through the backend actor with toast notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication, identity loading, and login state.",
  "frontend/src/hooks/usePhotographyWorks.ts": "React Query hooks for CRUD operations on photography works using the backend actor.",
  "frontend/src/hooks/usePortfolioCategories.ts": "React Query hooks for managing portfolio categories, including creation, editing, and deletion.",
  "frontend/src/hooks/useQueries.ts": "Provides basic backend query access by exposing actor and fetch state.",
  "frontend/src/index.css": "Defines Tailwind CSS layers, theme variables, and base styling for light and dark modes.",
  "frontend/src/main.tsx": "App entry point that initializes React, QueryClient, and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, values, and styled sections.",
  "frontend/src/pages/CertificatesPage.tsx": "Renders a certificates management page with CRUD dialogs and authenticated admin controls using certificate hooks.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form and static contact info cards with icons and office hours.",
  "frontend/src/pages/HomePage.tsx": "Shows a marketing-style landing page with hero content, feature cards, and navigation CTAs.",
  "frontend/src/pages/PortfolioPage.tsx": "Provides category and photography work management with CRUD dialogs, filtering, and authenticated admin tools.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme colors, fonts, shadows, and custom animations using several plugins.",
  "project_state.json": "Stores the project's state, including feature definitions, issues, and a summary of site requirements and theming problems."
}