{
  "backend/main.mo": "Actor implementing user profiles, categories, photography works, and certificates with access‑controlled CRUD operations.",
  "feature_evidence.json": "Feature evidence listing grouped‑works and hover‑info UI changes and the files involved.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of various frontend components, hooks, and pages.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark mode using OKLCH color tokens.",
  "frontend/index.html": "Minimal HTML scaffold mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app with manual routing, layout wrapper, theme provider, query client, and page rendering.",
  "frontend/src/components/AuthButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and error recovery.",
  "frontend/src/components/ContactForm.tsx": "Contact form component with validation, submission simulation, and success feedback.",
  "frontend/src/components/GroupedWorksSection.tsx": "Component rendering a category header and grid of works with hover thumbnails and edit/delete actions.",
  "frontend/src/components/SiteLayout.tsx": "Responsive site layout with navigation, theme toggle, mobile menu, and routing handler.",
  "frontend/src/components/WorkThumbnailHoverInfo.tsx": "Thumbnail component showing image with hover/focus overlay revealing work details.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor based on Internet Identity, auto-refreshing dependent queries.",
  "frontend/src/hooks/useAuthz.ts": "Determines authentication and admin status using actor and Internet Identity.",
  "frontend/src/hooks/useCertificates.ts": "React Query hooks for fetching, creating, updating, and deleting certificates via the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, identity persistence, and status tracking.",
  "frontend/src/hooks/usePhotographyWorks.ts": "React Query hooks for CRUD operations on photography works and category-based filtering.",
  "frontend/src/hooks/usePortfolioCategories.ts": "React Query hooks for managing portfolio categories including create, edit, and delete.",
  "frontend/src/hooks/useQueries.ts": "Placeholder hook exposing actor and loading state for future backend queries.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes plus base typographic styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with mission, values, and styled sections using icons and cards.",
  "frontend/src/pages/CertificatesPage.tsx": "Implements certificate listing and CRUD management with dialogs, forms, and auth‑gated actions.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact form and contact information with cards and icons.",
  "frontend/src/pages/HomePage.tsx": "Presents a landing page with hero, features, and navigation buttons to other pages.",
  "frontend/src/pages/PortfolioPage.tsx": "Supports portfolio category and work management with CRUD dialogs, tabs, and filtering.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s state, feature list, known issues, and summary for a photography portfolio website."
}