{
  "kind": "build_request",
  "title": "Group dashboard works by category sections and add hover info overlay",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Update the authenticated dashboard (Portfolio page → Management → Works tab) to display photography works grouped by category, with each category rendered as its own visible section containing that category’s works (instead of a single flat list).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make it look like each category as a section under photography works in dashboard."
        ]
      },
      "acceptanceCriteria": [
        "When an authenticated user opens Portfolio → Management → Works, works are grouped under headings/sections for each category.",
        "Each section clearly labels the category name (and may include the category description if present).",
        "Only works whose categoryId matches the section’s category are displayed inside that section.",
        "If a category has no works, the UI shows an explicit empty-state message within that category section (English text).",
        "Existing actions (Add Work, Edit, Delete) remain available and functional for works after the regrouping."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add a hover interaction for each work’s thumbnail in the dashboard grouped works view so that hovering over a photo reveals the work’s information (at minimum: title and category; include description when available) using an overlay or tooltip that does not require a click.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "And user can hover on the photo to see information"
        ]
      },
      "acceptanceCriteria": [
        "In Portfolio → Management → Works, hovering the pointer over a work’s thumbnail reveals an information UI (overlay or tooltip) with the work title and category name.",
        "If the work has a description, it is displayed in the hover information UI (truncated/clamped as needed).",
        "Hover UI does not interfere with Edit/Delete buttons (they remain clickable).",
        "All user-facing text introduced for the hover UI is in English.",
        "The hover UI is accessible: information is also reachable via keyboard focus on the thumbnail area (e.g., focus-visible styles + show-on-focus behavior)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only); compose them instead.",
    "Do not modify Internet Identity hooks/components in immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Keep the backend architecture as a single Motoko actor; no backend changes are required for this UI-only update."
  ],
  "nonGoals": [
    "Implementing an image/file picker or upload flow for photography works.",
    "Changing backend data models or adding new fields to works/categories.",
    "Changing the public gallery layout (non-dashboard) unless required to support the dashboard changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}