{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dashboard works: group by category sections + hover info overlay",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Regroup the authenticated Management → Works dashboard list into visible per-category sections with per-section empty states while preserving existing work actions.",
      "acceptanceCriteria": [
        "When an authenticated user opens Portfolio → Management → Works, works are grouped under headings/sections for each category.",
        "Each section clearly labels the category name (and may include the category description if present).",
        "Only works whose categoryId matches the section’s category are displayed inside that section.",
        "If a category has no works, the UI shows an explicit empty-state message within that category section (English text).",
        "Existing actions (Add Work, Edit, Delete) remain available and functional for works after the regrouping."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PortfolioPage.tsx",
          "operation": "modify",
          "description": "Update the authenticated Management → Works tab to render categories as separate sections, each showing only its matching works and an English empty-state when a category has no works; keep Add Work, Edit, and Delete actions wired and functional. Use existing shadcn-ui building blocks (e.g., Card, Button, Tabs) by composition only; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/GroupedWorksSection.tsx",
          "operation": "create",
          "description": "Create a reusable section component for the dashboard grouped works view that renders a category header (name + optional description) and its list of works (or an English per-category empty-state). Use composed shadcn-ui components (e.g., Card) rather than editing anything under frontend/src/components/ui; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Add hover/focus information UI on each dashboard work thumbnail to reveal title/category (and description when present) without blocking Edit/Delete actions.",
      "acceptanceCriteria": [
        "In Portfolio → Management → Works, hovering the pointer over a work’s thumbnail reveals an information UI (overlay or tooltip) with the work title and category name.",
        "If the work has a description, it is displayed in the hover information UI (truncated/clamped as needed).",
        "Hover UI does not interfere with Edit/Delete buttons (they remain clickable).",
        "All user-facing text introduced for the hover UI is in English.",
        "The hover UI is accessible: information is also reachable via keyboard focus on the thumbnail area (e.g., focus-visible styles + show-on-focus behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/WorkThumbnailHoverInfo.tsx",
          "operation": "create",
          "description": "Implement a focusable thumbnail wrapper for the dashboard works list that shows an overlay on hover and on keyboard focus, containing (at minimum) work title + category name and description when available (clamped). Ensure overlay is limited to the thumbnail area so it does not block Edit/Delete controls. Compose (do not modify) any shadcn-ui primitives used; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PortfolioPage.tsx",
          "operation": "modify",
          "description": "Wire the hover/focus overlay behavior into the authenticated Management → Works grouped sections by rendering each work thumbnail via WorkThumbnailHoverInfo, passing the resolved category name (and ensuring all newly introduced user-facing text is English). Keep Edit/Delete buttons outside the thumbnail overlay hit-area so they remain clickable. Use shadcn-ui components by composition only; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}